# ![](https://ga-dash.s3.amazonaws.com/production/assets/logo-9f88ae6c9c3871690e33280fcf557f33.png) Intro to Pandas 1
Week 1 | Day 5

### LEARNING OBJECTIVES
*After this lesson, you will be able to:*
- Read a csv file using pandas
- Viewing data: head, columns, values, describe
- Selection: a single column, slicing by row, by position
- Perform boolean indexing on dataframes
- Perform math functions using pandas.Series functions
- Inspect data types
- Clean up a column using df.apply()
- Know what situations to use .value_counts() in your code

<a name="Pandas"></a>
## Introduction: Topic (5 mins)

Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data
structures and data analysis tools for the Python programming language.

[pandas](http://pandas.pydata.org/)


<a name="Read csv"></a>
## Demo / Guided Practice: Topic (10 mins)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [17]:
# read in csv file and create a pandas dataframe
data = pd.read_csv("sales.csv")
data

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

**Check:** This looks familiar...didn't we already learn how to read in csv files?
Yes, but that was using Python without any libraries or packages. It took 5 lines of
Python, but using Pandas it only takes one line. Nice!

<a name="Viewing data: head/tail, describe"></a>
## Demo / Guided Practice: Viewing data: head/tail, describe (25 mins)

In [18]:
# head of dataset
data.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [19]:
# tail of dataset
data.tail()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented
17,123456,cosmos,neil,lucy,universe,1,"1,000,000",presented

**Check:** What can looking at the head and tail of a dataset tell us?

In [20]:
# summary stats

data.describe()

             Account   Quantity
count      18.000000  18.000000
mean   443432.111111   1.722222
std    263737.607563   1.017815
min    123456.000000   1.000000
25%    218895.000000   1.000000
50%    359944.500000   1.500000
75%    714466.000000   2.000000
max    740150.000000   5.000000

This gives us: count, mean, std, min, 25%, 50%, 75%, and max. Awesome!

**Check:** What was the cautionary tale about relying too heavily on summary stats again?


<a name="Selection: a single column, slicing by row, by position"></a>
## Demo / Guided Practice: Selection: a single column, slicing by row, by position (25 mins)

In [21]:
# select a single column

data["Name"]

0                  Trantow-Barrows
1                  Trantow-Barrows
2                  Trantow-Barrows
3     Fritsch, Russel and Anderson
4                     Kiehn-Spinka
5                        Kulas Inc
6                        Kulas Inc
7                    Jerde-Hilpert
8                       Barton LLC
9                       Herman LLC
10                     Purdy-Kunde
11                      Stokes LLC
12                      Stokes LLC
13     Kassulke, Ondricka and Metz
14                     Keeling LLC
15                       Koepp Ltd
16                       Koepp Ltd
17                          cosmos
Name: Name, dtype: object

**Check:** How would you select the 'Quantity' and 'Price' columns separately?

In [22]:
# slice certain rows 
data[1:5]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

**Check:** How would you slice for rows 9 to 14?

In [23]:
# slice for rows 9-14
data[9:15]

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won

##### Now, let's try selecting by position.

In [12]:
# First, let's slice some rows.

**Check:** How would you slice for rows 9 to 14?

In [24]:
# slice some columns
data[["Product", "Quantity", "Price"]]

        Product  Quantity      Price
0           CPU         1      30000
1      Software         1      10000
2   Maintenance         2       5000
3           CPU         1      35000
4           CPU         2      65000
5           CPU         2      40000
6      Software         1      10000
7   Maintenance         2       5000
8           CPU         1      35000
9           CPU         2      65000
10          CPU         1      30000
11  Maintenance         1       5000
12     Software         1      10000
13  Maintenance         3       7000
14          CPU         5     100000
15          CPU         2      65000
16      Monitor         2       5000
17     universe         1  1,000,000

**Check:** How would you slice for the 'Manager' and 'Product' columns?

In [15]:
# slice for the 'manager' column

In [26]:
# select for an explicit value only
# data.loc[0, "Price"]
data.iloc[0, 6]

'30000'

In [27]:
# create a dataframe

data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 73], 
        'preTestScore': [4, 24, 31, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70]}
df = pd.DataFrame(data, columns = 
                  ['name', 'age', 'preTestScore', 'postTestScore'])
df

    name  age  preTestScore  postTestScore
0  Jason   42             4             25
1  Molly   52            24             94
2   Tina   36            31             57
3   Jake   24             2             62
4    Amy   73             3             70

In [28]:
# find the sum of all the ages using pandas
df["age"].sum()

227

In [29]:
# find the sum of all the ages using numpy
np.sum(df["age"])

227

In [6]:
# find the mean preTestScore using pandas

In [7]:
# find the mean preTestScore using numpy

In [8]:
# find the min value of preTestScore using pandas

In [10]:
# find the min value of preTestScore using numpy

In [11]:
# find the max value of preTestScore using pandas

In [12]:
# find the max value of preTestScore using numpy

In [13]:
# find the median value of preTestScore using pandas

In [14]:
# find the median value of preTestScore using numpy

<a name="Series and DataFrame data types"></a>
## Introduction: Series and DataFrame data types (10 mins)

- Series is a one-dimensional labeled array capable of holding any data type (integers, strings,
floating point numbers, Python objects, etc.). The axis labels are collectively referred to as
the index. The basic method to create a Series is to call:

```Python
s = pd.Series(data, index=index)
```

- Here, data can be many different things:
    - a Python dict
    - an ndarray
    - a scalar value (like 5)

- The passed index is a list of axis labels.



- DataFrame is a 2-dimensional labeled data structure with columns of potentially
different types. You can think of it like a spreadsheet or SQL table, or a dict
of Series objects. It is generally the most commonly used pandas object.

- Like Series, DataFrame accepts many different kinds of input:
    - Dict of 1D ndarrays, lists, dicts, or Series
    - 2-D numpy.ndarray
    - Structured or record ndarray
    - A Series
    - Another DataFrame

- Along with the data, you can optionally pass index (row labels) and columns
(column labels) arguments. If you pass an index and / or columns, you are
guaranteeing the index and / or columns of the resulting DataFrame. Thus, a dict
of Series plus a specific index will discard all data not matching up to the
passed index.

- If axis labels are not passed, they will be constructed from the input data based on common sense rules.

Here is more information on [series and dataframes](http://pandas.pydata.org/pandas-docs/stable/dsintro.html).

**Check:** What are some differences between Series and DataFrame?

<a name="pd.Series"></a>
## Demo / Guided Practice: pd.Series (25 mins)

Let's create a series and see what `pandas.Series` can do.

In [2]:
# create a series using a numpy random number generator

s = pd.Series(np.random.randint(5, 25, 7), index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])  
s

a    17
b     5
c    13
d     9
e    20
f    14
g    16
dtype: int32


Now we have a series of 7 random numbers. Let's try out the same things we did with
a data frame back in W2 L1.1. First, let's look at the series head.

In [3]:
# head of series
s.head()

a    17
b     5
c    13
d     9
e    20
dtype: int32

<details>
    <summary>Solution</summary>
    <code>s.head()</code>
</details>

In [4]:
# tail of series
s.tail()

c    13
d     9
e    20
f    14
g    16
dtype: int32

In [5]:
# summary stats
s.describe()

count     7.000000
mean     13.428571
std       5.061526
min       5.000000
25%      11.000000
50%      14.000000
75%      16.500000
max      20.000000
dtype: float64

In [8]:
# select by location c to g
# s[["c", "g"]]
s["c":"g"]

c    13
d     9
e    20
f    14
g    16
dtype: int32

In [9]:
# select just b
s["b"]

5

In [11]:
# slice for rows 1-3
s[1:4]

b     5
c    13
d     9
dtype: int32

**Check:** How would you select just 'd'?

<a name="Boolean indexing"></a>
## Demo / Guided Practice: Boolean indexing (25 mins)

Another common operation is the use of boolean vectors to filter the data. The operators
are: | for or, & for and, and ~ for not. These must be grouped by using parentheses.

Let's create another series and use pandas to do some Boolean indexing.

In [12]:
# create another series ranging from -3 to 3

s = pd.Series(range(-3, 4))
s

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [14]:
# find the values that are > 0. 
mask = s > 0
s[mask]

4    1
5    2
6    3
dtype: int64

In [15]:
# find the values that are < -1 or > 0.5
mask = (s < -1) | (s > 0.5)
s[mask]

0   -3
1   -2
4    1
5    2
6    3
dtype: int64

In [16]:
# find the values that are not < 0.
mask = ~(s < 0)
s[mask]

3    0
4    1
5    2
6    3
dtype: int64

Here is some further information on [boolean indexing](http://pandas.pydata.org/pandas-docs/stable/indexing.html#slicing-ranges).

**Check:** How would you find all the numbers that are < 2?

In [32]:
# find the values that are < 2

<a name="ind-practice"></a>
## Independent Practice: (25 minutes)
- Create a series
- Look at the head, tail, and summary stats
- Select certain values by location
- Slice for certain rows
- Using Boolean indexing find values that are < than another value
- Using Boolean indexing find values that are > than another value
- Using Boolean indexing find values that are < than another value and > another value

<a name="introduction"></a>
## Introduction: Topic (5 mins)

Since we're starting to get pretty comfortable with using pandas to do EDA, let's add a
couple more tools to our toolbox.

The main data types stored in pandas objects are float, int, bool, datetime64, datetime64, timedelta,
category, and object.

df.apply() will apply a function along any axis of the DataFrame. We'll see it in action below.

pandas.Series.value_counts returns Series containing counts of unique values. The resulting
Series will be in descending order so that the first element is the most frequently-occurring
element. Excludes NA values.

- Examples of [dtypes](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).
- Examples of [value_counts](http://nullege.com/codes/search/pandas.Series.value_counts).

<a name="Inspect data types "></a>
## Demo /Guided Practice: Inspect data types  (20 mins)

Let's create a small dictionary with different data types in it.

In [3]:
import pandas as pd
import numpy as np
dft = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('20010102'),
                        E = pd.Series([1.0]*3).astype('float32'),
                        F = False,
                        G = pd.Series([1]*3,dtype='int8')))
dft

          A  B    C          D    E      F  G
0  0.102307  1  foo 2001-01-02  1.0  False  1
1  0.673515  1  foo 2001-01-02  1.0  False  1
2  0.596352  1  foo 2001-01-02  1.0  False  1

There is a really easy way to see what kind of dtypes are in each column.

In [5]:
dft.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

If a pandas object contains data multiple dtypes IN A SINGLE COLUMN, the dtype of the
column will be chosen to accommodate all of the data types (object is the most general).

In [8]:
# these ints are coerced to floats
pd.Series([1, 2, 3, 4, 5, 6.])

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.0
dtype: float64

In [9]:
# string data forces an ``object`` dtype
pd.Series([1, 2, 3, 6., 'foo'])

0      1
1      2
2      3
3      6
4    foo
dtype: object

The method `DataFrame.dtypes.value_counts()` will return the number of columns of each type in a DataFrame:

In [10]:
dft.dtypes.value_counts()

int64             1
int8              1
object            1
datetime64[ns]    1
bool              1
float64           1
float32           1
dtype: int64

You can do a lot more with dtypes that you can check out [here](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).

**Check:** Why do you think it might be important to know what kind of dtypes you're working with?

<a name=" df.apply()"></a>
## Demo /Guided Practice:  df.apply() (20 mins)

Let's create a small data frame.

In [11]:
df = pd.DataFrame(np.random.randint(0 , 10, (5, 4)), columns=['a', 'b', 'c', 'd'])
df

   a  b  c  d
0  9  0  4  3
1  5  6  2  1
2  0  1  7  4
3  2  7  3  0
4  8  2  4  0

Use `df.apply` to find the square root of all the values.

In [12]:
df.apply(np.sqrt)

          a         b         c         d
0  3.000000  0.000000  2.000000  1.732051
1  2.236068  2.449490  1.414214  1.000000
2  0.000000  1.000000  2.645751  2.000000
3  1.414214  2.645751  1.732051  0.000000
4  2.828427  1.414214  2.000000  0.000000

Find the mean of all of the columns.

In [15]:
df.apply(np.mean)

a    4.8
b    3.2
c    4.0
d    1.6
dtype: float64

Find the mean of all of the rows.

In [16]:
df.apply(np.mean, axis=1)

0    4.0
1    3.5
2    3.0
3    3.0
4    3.5
dtype: float64

[df.apply](https://gist.github.com/why-not/4582705)
[df.apply](http://chrisalbon.com/python/pandas_apply_operations_to_dataframes.html)

**Check:** How would find the std of the columns and rows?

<a name=".value_counts()"></a>
## Demo /Guided Practice: .value_counts() (20 mins)

Let's create a random array with 50 numbers, ranging from 0 to 7.

In [17]:
data = np.random.randint(0, 7, size = 50)
data

array([4, 2, 2, 5, 1, 1, 2, 2, 4, 1, 4, 6, 1, 2, 0, 6, 6, 6, 4, 4, 6, 5,
       6, 5, 3, 2, 4, 2, 1, 3, 0, 0, 1, 5, 1, 0, 0, 3, 6, 0, 3, 1, 5, 2,
       3, 1, 3, 1, 2, 5])

Convert the array into a series.

In [18]:
s = pd.Series(data)

How many of each number is there in the series? Enter `value_counts()`:

In [19]:
s.value_counts()

1    10
2     9
6     7
5     6
4     6
3     6
0     6
dtype: int64

<a name="ind-practice"></a>
## Independent Practice: Topic (20 minutes)
- Use the [sales.csv data set](./assets/datasets/sales_info.csv) - we've seen this a few times in previous lessons!
- Inspect the data types
- You've found out that all your values in column 1 are off by 1, add 1 to column 1 of the dataset
- Use .value_counts to count the values of 1 column of the dataset

**Bonus**
- Add 3 to column 2
- Use .value_counts for each column of the dataset